1.	SELECT "Н_ОЦЕНКИ"."КОД", "Н_ВЕДОМОСТИ"."ДАТА"
FROM "Н_ВЕДОМОСТИ"
RIGHT JOIN "Н_ОЦЕНКИ" ON "Н_ВЕДОМОСТИ"."ОЦЕНКА" = "Н_ОЦЕНКИ"."КОД"
WHERE "Н_ОЦЕНКИ"."КОД" < 'неявка'
AND "Н_ВЕДОМОСТИ"."ИД" > 1490007
AND "Н_ВЕДОМОСТИ"."ИД" < 39921;

2.	SELECT Н_ОЦЕНКИ.КОД, Н_ВЕДОМОСТИ.ДАТА
3.	FROM Н_ВЕДОМОСТИ
4.	RIGHT JOIN Н_ОЦЕНКИ ON Н_ВЕДОМОСТИ.ИД = Н_ОЦЕНКИ.ВЕД_ИД
5.	WHERE Н_ОЦЕНКИ.КОД < 'неявка' AND Н_ВЕДОМОСТИ.ИД > 1490007 AND Н_ВЕДОМОСТИ.ИД < 39921;

2. SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ЧЛВК_ИД
FROM Н_ЛЮДИ
LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.СЭС_ИД
WHERE Н_ЛЮДИ.ИМЯ < 'Роман'
AND Н_ВЕДОМОСТИ.ДАТА = '2010-06-18'

3. FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE ДАТА_РОЖДЕНИЯ >= '1999-04-29' AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';

5.	SELECT "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", AVG(CASE WHEN ("ОЦЕНКА" <> 'зачет' AND "ОЦЕНКА" <> 'осв' AND "ОЦЕНКА" <> 'незач' AND "ОЦЕНКА" <> 'неявка') THEN CAST("ОЦЕНКА" AS INTEGER) END) AS "СР_ОЦЕНКА", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
FROM "Н_ВЕДОМОСТИ"
JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
JOIN "Н_ЛЮДИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
GROUP BY "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
HAVING AVG(CASE
    WHEN ("ОЦЕНКА" <> 'зачет'
                          AND "ОЦЕНКА" <> 'осв'
                          AND "ОЦЕНКА" <> 'незач'
                          AND "ОЦЕНКА" <> 'неявка')
        THEN CAST("ОЦЕНКА" AS INTEGER)
    END) = (
    SELECT min(CASE WHEN ("ОЦЕНКА" <> 'зачет' AND "ОЦЕНКА" <> 'осв' AND "ОЦЕНКА" <> 'незач' AND "ОЦЕНКА" <> 'неявка') THEN CAST("ОЦЕНКА" AS INTEGER) END)
    FROM "Н_ВЕДОМОСТИ"
             JOIN "Н_УЧЕНИКИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1101'
);

6.	SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ПЛАНЫ"."НОМЕР", "Н_УЧЕНИКИ"."СОСТОЯНИЕ"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
WHERE "Н_УЧЕНИКИ"."ПЛАН_ИД" IN(
    SELECT "Н_ПЛАНЫ"."ИД"
    FROM "Н_ПЛАНЫ"
    WHERE "Н_ПЛАНЫ"."КУРС" = 1 AND ("Н_ПЛАНЫ"."ФО_ИД" = 1 OR "Н_ПЛАНЫ"."ФО_ИД" = 3) AND DATE("Н_ПЛАНЫ"."ДАТА_УТВЕРЖДЕНИЯ") > '2012-09-01'
)
GROUP BY "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ПЛАНЫ"."НОМЕР", "Н_УЧЕНИКИ"."СОСТОЯНИЕ";

7.	select count(distinct students."ЧЛВК_ИД") as ЧИСЛО_ТРОЧЕНИКОВ_В_310
from "Н_УЧЕНИКИ" students
         join "Н_ВЕДОМОСТИ" statement on students."ЧЛВК_ИД" = statement."ЧЛВК_ИД"
where statement."ОЦЕНКА" not in ('зачет', 'незач', 'неявка', 'осв', 'осв', '99', '4', '5', '2')
  and statement."ОЦЕНКА" is not null
  and students."ГРУППА" = '3100'
;
